{
    "name": "NIST Cybersecurity Policy",
    "description": "This policy is based on the National Institute of Standards and Technology (NIST) Cybersecurity Framework, which provides guidelines for improving cybersecurity risk management and resilience. The policy focuses on secure TLS configurations to protect data in transit and prevent unauthorized access.",
    "rules": [{
            "name": "TLS VERSION FOR CONNECTION",
            "code": "R01",
            "description": "Checking the TLS Version Used for the Connection",
            "connection_type": "TLS_CONNECTION",
            "connection_field": "TLS_CONNECTION_VERSION"
        }, {
            "name": "TLS PROTOCOL CHOSEN CIPHERSUITE FOR CONNECTION",
            "code": "R02",
            "description": "Checking the Chosen Ciphersuite used for connection",
            "connection_type": "TLS_CONNECTION",
            "connection_field": "TLS_CONNECTION_CIPHERSUITE"
        }
    ],
    "policy_rules": [{
            "code": "PR01",
            "rule": "R01",
            "sub_rules": ["SR02", "SR03", "SR04", "SR05"],
            "violation_data": {
                "HIGH": {
                    "title": "Outdated and Insecure Protocols",
                    "description": "SSL v2 and SSL v3 are deprecated and considered highly insecure due to numerous vulnerabilities, including lack of proper encryption and susceptibility to attacks like POODLE. Connections using these protocols risk exposing sensitive data and enabling unauthorized access."
                },
                "MEDIUM": {
                    "title": "Legacy Protocols with Weak Security",
                    "description": "TLS v1.0 and TLS v1.1 are outdated and no longer considered secure by modern standards. These protocols lack support for strong encryption algorithms and are vulnerable to attacks such as BEAST and downgrade attacks. Migration to TLS v1.2 or higher is strongly recommended."
                },
                "LOW": {
                    "title": "Improved but Aging Protocol",
                    "description": "While TLS v1.2 is widely used and more secure than older protocols, it lacks the advanced security features of TLS v1.3, such as faster handshakes and stronger default cipher suites. For enhanced security, upgrading to TLS v1.3 is recommended where possible."
                }
            },
            "consequence": "Non-compliance with secure TLS version requirements exposes connections to potential interception, data breaches, and unauthorized access due to known vulnerabilities in outdated protocols.",
            "explanation": "Older TLS versions (SSL v2/v3, TLS 1.0/1.1) lack adequate security measures and are vulnerable to attacks such as POODLE, BEAST, and downgrade attacks, putting encrypted communications at significant risk.",
            "remediation": "Upgrade all systems to support TLS v1.2 or higher, with a preference for TLS v1.3, and disable all outdated protocols to ensure secure and compliant communication."
        }, {
            "code": "PR02",
            "rule": "TLS PROTOCOL CHOSEN CIPHERSUITE FOR CONNECTION",
            "sub_rules": ["SR1"],
            "violation_data": {
                "HIGH": {
                    "title": "Use of Weak or Deprecated Cipher Suites",
                    "description": "Cipher suites with weak encryption, key exchange, or hashing algorithms expose connections to vulnerabilities such as BEAST, POODLE, or downgrade attacks. These suites fail to meet modern security standards, jeopardizing data confidentiality and integrity."
                },
                "MEDIUM": {
                    "title": "Use of Non-Standard or Less Adopted Cipher Suites",
                    "description": "Cipher suites that lack widespread adoption or are not aligned with established standards may introduce interoperability challenges and reduced confidence in their security. While not known to have vulnerabilities, these suites may lack thorough testing and community scrutiny."
                },
                "LOW": {
                    "title": "Not Applicable",
                    "description": "No low-risk violations found."
                }
            },
            "consequence": "Non-compliant cipher suites increase the risk of data breaches and operational issues. High-risk suites with known vulnerabilities can expose sensitive data to attacks like POODLE, BEAST, or downgrade attacks, while medium-risk suites—though secure—may cause interoperability challenges and reduce trust due to limited adoption or scrutiny.",
            "explanation": "High-risk cipher suites rely on weak components such as outdated encryption algorithms (e.g., DES/3DES), insecure key exchanges (e.g., RSA without PFS), or deprecated hashing methods (e.g., MD5). Medium-risk cipher suites, while not inherently vulnerable, may lack widespread adoption or alignment with modern standards, raising concerns about undiscovered vulnerabilities or compatibility issues.",
            "remediation": "Replace weak or deprecated cipher suites with strong, secure alternatives that adhere to NIST or IETF standards. For TLS 1.3, use cipher suites like TLS_AES_128_GCM_SHA256. For TLS 1.2, prioritize suites that include ECDHE for key exchange, AES-GCM for encryption, and SHA-256 or better for hashing. Regularly review and update configurations to ensure compliance with evolving standards and avoid using less adopted suites."
        }],

        "sub_rules": [{ 
                "code": "SR01",
                "label": "SHALL",
                "sub_rule_values": ["SRV01"],
                "rule": "R02"
            }, {
                "code": "SR02",  
                "label": "SHALL",
                "sub_rule_values": ["SRV02"],
                "rule": "R01"
            }, {
                "code": "SR03",  
                "label": "SHOULD",
                "sub_rule_values": ["SRV03"],
                "rule": "R01"
            }, {
                "code": "SR04",  
                "label": "SHOULD_NOT",
                "sub_rule_values": ["SRV04"],
                "rule": "R01"
            }, {
                "code": "SR05",  
                "label": "SHALL_NOT",
                "sub_rule_values": ["SRV05"],
                "rule": "R01"
            }],

        "sub_rule_values": [{
                "code": "SRV01",
                "connection_field": "TLS_CONNECTION_CIPHERSUITE",
                "value": ["TLS_AES_128_GCM_SHA256", "TLS_AES_256_GCM_SHA384", "TLS_CHACHA20_POLY1305_SHA256"]
            },  {
                "code": "SRV02",
                "connection_field": "TLS_CONNECTION_VERSION",
                "value": [13]
            }, {
                "code": "SRV03",
                "connection_field": "TLS_CONNECTION_VERSION",
                "value": [12]
            }, {
                "code": "SRV04",
                "connection_field": "TLS_CONNECTION_VERSION",
                "value": [10, 11]
            }, {
                "code": "SRV05",
                "connection_field": "TLS_CONNECTION_VERSION",
                "value": [20, 30]
            }]
}